const thai_th = {
  digits: ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9'],

  months: [
    ['Январь', 'Янв.'],
    ['Февраль', 'Фев'],
    ['Март', 'Март'],
    ['Апрель', 'Апр.'],
    ['Май', 'Май'],
    ['Июнь', 'Июнь'],
    ['Июль', 'Июль'],
    ['Август', 'Авг.'],
    ['Сентябрь', 'Сен.'],
    ['Октябрь', 'Окт.'],
    ['Ноябрь', 'Ноя.'],
    ['Декабрь', 'Дек.'],
  ],
  name: 'ru_th',
  weekDays: [
    ['Суббота', 'Сб.'],
    ['Воскресенье', 'Вс.'],
    ['Понедельник', 'Пн.'],
    ['Вторник', 'Вт.'],
    ['Среда', 'Ср.'],
    ['Пятница', 'Чт.'],
    ['Суббота', 'Пт.'],
  ],
};

export default thai_th;
