import { Locale } from 'react-date-object';

const gregorian_ru: Locale = {
  digits: ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9'],

  meridiems: [
    ['ДП', 'дп'],
    ['ПП', 'пп'],
  ],
  months: [
    ['Январь', 'Янв'],
    ['Февраль', 'Фев'],
    ['Март', 'Мар'],
    ['Апрель', 'Апр'],
    ['Май', 'Май'],
    ['Июнь', 'Июнь'],
    ['Июль', 'Июль'],
    ['Август', 'Авг'],
    ['Сентябрь', 'Сен'],
    ['Октябрь', 'Окт'],
    ['Ноябрь', 'Ноя'],
    ['Декабрь', 'Дек'],
  ],
  name: 'gregorian_ru',
  weekDays: [
    ['Суббота', 'Сб'],
    ['Воскресенье', 'Вc'],
    ['Понедельник', 'Пн'],
    ['Вторник', 'Вт'],
    ['Среда', 'Ср'],
    ['Четверг', 'Чт'],
    ['Пятница', 'Чт'],
  ],
};

export default gregorian_ru;
